Repository: xjtuyanshi/WeightCoach-Public
Catalog: WeightCoach/Localizable.xcstrings
Source language: zh_hans
Languages: en, zh_hant

source: 取消
en: Cancel

source: 保存
en: Save
zh_hant: 儲存

source: 完成
en: Done

source: 好
en: OK

source: 重试
en: Try Again
zh_hant: 重試

source: 请稍后重试
en: Please try again later
zh_hant: 請稍後再試

source: 保存失败
en: Couldn’t Save
zh_hant: 儲存失敗

source: 删除失败
en: Couldn’t Delete
zh_hant: 刪除失敗

source: 操作失败
en: Action Failed
zh_hant: 操作失敗

source: 日期
en: Date

source: 时间
en: Time
zh_hant: 時間

source: 千卡
en: kcal
zh_hant: 大卡

source: 克
en: g

source: 个
en: item
zh_hant: 個

source: 份
en: serving

source: 暂无
en: No data
zh_hant: 暫無

source: 未填写
en: Not entered
zh_hant: 未填寫

source: 未提供
en: Not provided

source: 记录
en: Log
zh_hant: 記錄

source: 撤销
en: Undo
zh_hant: 復原

source: 再记
en: Log Again
zh_hant: 再記一次

source: 体重
en: Weight
zh_hant: 體重

source: 当前体重
en: Current Weight
zh_hant: 目前體重

source: 距离目标
en: To Goal
zh_hant: 距離目標

source: 体脂率
en: Body Fat
zh_hant: 體脂率

source: 预计达成
en: Projected Goal
zh_hant: 預計達成

source: 体重趋势
en: Weight Trend
zh_hant: 體重趨勢

source: 暂无体重数据
en: No Weight Data
zh_hant: 尚無體重資料

source: 点右上角 + 记录一次体重
en: Tap + in the top right to log your weight
zh_hant: 點右上角的 + 記錄一次體重

source: 虚线为按计划的目标轨迹
en: The dashed line shows your planned goal path
zh_hant: 虛線為依計畫的目標軌跡

source: 体脂率趋势
en: Body Fat Trend
zh_hant: 體脂率趨勢

source: 最近记录
en: Recent Entries
zh_hant: 最近記錄

source: 测量数据
en: Measurements
zh_hant: 測量資料

source: 体脂率（可选）
en: Body Fat (Optional)
zh_hant: 體脂率（選填）

source: 记录体重
en: Log Weight
zh_hant: 記錄體重

source: 已保存到 App
en: Saved in the App
zh_hant: 已儲存到 App

source: 这次未能写入 Apple 健康，本地体重记录仍然保留。
en: This entry couldn’t be written to Apple Health. Your local weight entry is still saved.
zh_hant: 這次無法寫入 Apple 健康，本機體重記錄仍會保留。

source: 本地保存失败，请重试。
en: Couldn’t save locally. Please try again.
zh_hant: 本機儲存失敗，請再試一次。

source: 饮食记录
en: Food Log
zh_hant: 飲食記錄

source: 当日合计
en: Daily Total
zh_hant: 當日合計

source: 还没有记录
en: Nothing Logged Yet
zh_hant: 還沒有記錄

source: 用下方按钮记录你吃的东西
en: Use a button below to log what you ate
zh_hant: 用下方按鈕記錄你吃的東西

source: 拍照识别
en: Scan Food
zh_hant: 拍照辨識

source: 扫码
en: Barcode
zh_hant: 掃碼

source: 手动
en: Manual
zh_hant: 手動

source: 重试健康同步
en: Retry Health Sync
zh_hant: 重試健康同步

source: Apple 健康同步中
en: Syncing to Apple Health
zh_hant: 正在同步至 Apple 健康

source: 已保存到 App · 健康同步失败
en: Saved in App · Health Sync Failed
zh_hant: 已儲存到 App · 健康同步失敗

source: 已同步到 Apple 健康
en: Synced to Apple Health
zh_hant: 已同步至 Apple 健康

source: 运动补记
en: Manual Exercise
zh_hant: 補記運動

source: 只补记 Apple 健康没有完整记录的运动。稍后同步到的健康数据会自动从补差中扣除。
en: Only log exercise that Apple Health didn’t fully capture. Health data synced later will automatically be deducted from the supplement.
zh_hant: 只補記 Apple 健康未完整記錄的運動。稍後同步的健康資料會自動從補差中扣除。

source: 篮球时长请填真正活动的分钟数，不包含坐场边、长时间休息或聊天。
en: For basketball, enter only the minutes you were actually active, excluding time on the bench, long breaks, or chatting.
zh_hant: 籃球時長請填真正活動的分鐘數，不含坐場邊、長時間休息或聊天。

source: 避免重复计算
en: Avoid Double Counting
zh_hant: 避免重複計算

source: 手动记录不会写回 Apple 健康。热量是基于体重与运动强度的群体估算，不是精密测量。
en: Manual entries aren’t written to Apple Health. Calories are population estimates based on weight and intensity, not precise measurements.
zh_hant: 手動記錄不會寫回 Apple 健康。熱量是依體重與運動強度的群體估算，並非精密測量。

source: 还没有运动补记
en: No Manual Exercise Yet
zh_hant: 還沒有補記運動

source: 不戴手表打球或跑步后，点右上角 + 记录
en: After playing or running without your watch, tap + in the top right
zh_hant: 沒戴手錶打球或跑步後，點右上角的 + 記錄

source: 最近补记
en: Recent Manual Entries
zh_hant: 最近補記

source: 记录运动
en: Log Exercise
zh_hant: 記錄運動

source: 今天的手动运动
en: Today’s Manual Exercise
zh_hant: 今天的手動運動

source: 自动去重
en: Auto-Deduplicated
zh_hant: 自動去重

source: 仅展示
en: Display Only
zh_hant: 僅顯示

source: 估算活动
en: Estimated
zh_hant: 估算活動

source: 健康已记
en: In Health
zh_hant: 健康已記錄

source: 实际补入
en: Added
zh_hant: 實際補入

source: 未计入预算
en: Not in Budget
zh_hant: 未計入預算

source: 设置中当前使用活动系数模式，手动运动不会额外增加今天的热量预算。
en: Activity-factor mode is enabled in Settings, so manual exercise won’t increase today’s calorie budget.
zh_hant: 設定中目前使用活動係數模式，手動運動不會額外增加今天的熱量預算。

source: 活动千卡
en: active kcal
zh_hant: 活動大卡

source: 运动类型
en: Exercise Type
zh_hant: 運動類型

source: 类型
en: Type
zh_hant: 類型

source: 强度
en: Intensity
zh_hant: 強度

source: 时间与体重
en: Time & Weight
zh_hant: 時間與體重

source: 开始时间
en: Start Time
zh_hant: 開始時間

source: 当时体重
en: Weight at the Time
zh_hant: 當時體重

source: 结束时间不能晚于现在，请调整开始时间或活动时长。
en: The end time can’t be in the future. Adjust the start time or duration.
zh_hant: 結束時間不能晚於現在，請調整開始時間或活動時長。

source: 预计净活动热量
en: Estimated Net Active Energy
zh_hant: 預估淨活動熱量

source: 已减去同一时段原本会消耗的静息热量
en: Resting energy for the same period has been deducted
zh_hant: 已扣除同一時段原本會消耗的靜息熱量

source: 采用 2024 Adult Compendium 的 MET 群体估算。篮球请只填真正活动时间；App 会再扣除同一时段 Apple 健康已经记录的活动能量。
en: Uses population MET estimates from the 2024 Adult Compendium. For basketball, enter only active time; the app will deduct activity energy already recorded by Apple Health for the same period.
zh_hant: 採用 2024 Adult Compendium 的 MET 群體估算。籃球請只填真正活動時間；App 會再扣除同一時段 Apple 健康已記錄的活動能量。

source: 补记运动
en: Add Manual Exercise
zh_hant: 補記運動

source: 请检查体重、时长和运动强度。
en: Check the weight, duration, and exercise intensity.
zh_hant: 請檢查體重、時長和運動強度。

source: 结束时间不能晚于现在。
en: The end time can’t be in the future.
zh_hant: 結束時間不能晚於現在。

source: 这段时间已有手动运动记录，请调整时间，避免重复计算。
en: A manual exercise entry already overlaps this time. Adjust the time to avoid double counting.
zh_hant: 這段時間已有手動運動記錄，請調整時間以免重複計算。

source: 添加食物
en: Add Food
zh_hant: 新增食物

source: 确认食物
en: Confirm Food
zh_hant: 確認食物

source: 输入一个字，如：西、虾、rice
en: Type a letter, e.g. b, s, rice
zh_hant: 輸入一個字，例如：西、蝦、rice

source: 清除搜索
en: Clear Search
zh_hant: 清除搜尋

source: 输入一个字就会立即出现匹配项；点选后按实际克重自动换算。
en: Matches appear as you type. Select one and enter the actual weight for automatic calculation.
zh_hant: 輸入一個字就會立即顯示符合項目；點選後依實際克重自動換算。

source: 所有数值按可食部分重量估算，不包含额外用油或酱汁。
en: All values are estimated by edible weight and exclude extra oil or sauce.
zh_hant: 所有數值依可食部分重量估算，不含額外用油或醬汁。

source: 换一种食物
en: Choose a Different Food
zh_hant: 換一種食物

source: 实际吃了多少
en: Amount Eaten
zh_hant: 實際吃了多少

source: 常用份量
en: Common Portions

source: 按去壳、去皮后的可食部分估算；大小不同，可以继续修改克重。
en: Estimated by edible weight after removing the shell or peel. Adjust the grams for size differences.
zh_hant: 依去殼、去皮後的可食部分估算；大小不同，可繼續修改公克數。

source: 可食部分重量
en: Edible Weight

source: 重量
en: Weight

source: 餐次
en: Meal

source: 自动换算
en: Calculated Nutrition
zh_hant: 自動換算

source: 通用食物参考值；品牌、品种和烹调方式会造成差异
en: Generic reference values; brands, varieties, and preparation methods vary
zh_hant: 通用食物參考值；品牌、品種與烹調方式會造成差異

source: 请输入 0–10,000 克之间的有效重量
en: Enter a valid weight from 0 to 10,000 g
zh_hant: 請輸入 0–10,000 克之間的有效重量

source: 品牌饮品核对
en: Branded Drink Check
zh_hant: 品牌飲品核對

source: 星巴克定制饮品
en: Customized Starbucks Drink
zh_hant: 星巴克客製飲品

source: 按杯型、最终糖浆泵数和蛋白冷泡沫核对
en: Check size, final syrup pumps, and protein cold foam
zh_hant: 依杯型、最終糖漿泵數和蛋白冷泡沫核對

source: 常见食物
en: Common Foods
zh_hant: 常見食物

source: 没有匹配的常见食物
en: No Common Food Matches
zh_hant: 沒有符合的常見食物

source: 仍然可以保留这个名称，自行填写热量与营养。
en: You can keep this name and enter calories and nutrients manually.
zh_hant: 仍可保留這個名稱，自行填寫熱量與營養。

source: 参考库完全离线，无需账号或 API Key；包装食品仍建议扫描条形码或营养标签。
en: The reference catalog works fully offline with no account or API key. For packaged foods, scan the barcode or nutrition label.
zh_hant: 參考資料庫完全離線，不需帳號或 API Key；包裝食品仍建議掃描條碼或營養標示。

source: 选择后输入重量
en: Select, then enter the weight
zh_hant: 選擇後輸入重量

source: 热量
en: Calories
zh_hant: 熱量

source: 蛋白质
en: Protein
zh_hant: 蛋白質

source: 碳水
en: Carbs

source: 脂肪
en: Fat

source: 自行填写热量与营养
en: Enter Calories & Nutrition Manually
zh_hant: 自行填寫熱量與營養

source: 食物信息
en: Food Details
zh_hant: 食物資訊

source: 名称（如：牛肉面）
en: Name (e.g. beef noodles)
zh_hant: 名稱（例如：牛肉麵）

source: 热量（千卡）
en: Calories (kcal)
zh_hant: 熱量（大卡）

source: 份量描述（可选，如：一大碗）
en: Portion (optional, e.g. large bowl)
zh_hant: 份量描述（選填，例如：一大碗）

source: 营养素（可选，克）
en: Nutrients (Optional, g)
zh_hant: 營養素（選填，克）

source: 碳水化合物
en: Carbohydrates

source: 营养素请填写大于或等于 0 的数字；留空表示不知道
en: Enter nutrient values of 0 or greater. Leave blank if unknown.
zh_hant: 營養素請填寫大於或等於 0 的數字；留白表示未知

source: 咖啡因（毫克）
en: Caffeine (mg)

source: 咖啡因（可选）
en: Caffeine (Optional)
zh_hant: 咖啡因（選填）

source: 留空表示不知道；明确不含咖啡因可填写 0。
en: Leave blank if unknown. Enter 0 only if it is known to be caffeine-free.
zh_hant: 留白表示未知；確定不含咖啡因時可填 0。

source: 自行填写
en: Manual Entry
zh_hant: 自行填寫

source: 扫码记录
en: Scan Barcode
zh_hant: 掃碼記錄

source: 对准商品条形码
en: Point at the Product Barcode
zh_hant: 對準商品條碼

source: 相机扫码不可用
en: Camera Scanning Unavailable
zh_hant: 相機掃碼無法使用

source: 当前设备不支持实时扫码或未授权相机。可以在下方手动输入条形码数字。
en: Live scanning isn’t available or camera access wasn’t granted. Enter the barcode number below.
zh_hant: 目前裝置不支援即時掃碼或未授權相機。可在下方手動輸入條碼數字。

source: 正在查询商品信息…
en: Looking Up Product…
zh_hant: 正在查詢商品資訊…

source: 扫描包装营养表
en: Scan Nutrition Label
zh_hant: 掃描包裝營養標示

source: 只在本机识别；确认后会按这个条码保存，下次直接秒开。
en: Processed only on this device. After confirmation it is saved for this barcode for instant access next time.
zh_hant: 只在本機辨識；確認後會依此條碼儲存，下次可立即開啟。

source: 手动输入条形码（UPC/EAN）
en: Enter Barcode (UPC/EAN)
zh_hant: 手動輸入條碼（UPC/EAN）

source: 查询
en: Look Up
zh_hant: 查詢

source: 商品
en: Product

source: 本地秒开
en: Saved Offline
zh_hant: 本機秒開

source: 重新扫描
en: Scan Again
zh_hant: 重新掃描

source: 这次吃了多少
en: Amount Eaten
zh_hant: 這次吃了多少

source: 商品数据不足，无法可靠换算。请重新扫描或改用手动记录。
en: There isn’t enough product data for a reliable calculation. Scan again or use manual entry.
zh_hant: 商品資料不足，無法可靠換算。請重新掃描或改用手動記錄。

source: 单位
en: Unit
zh_hant: 單位

source: 数量
en: Quantity
zh_hant: 數量

source: 自动计算
en: Calculated Total
zh_hant: 自動計算

source: 本次摄入
en: This Entry
zh_hant: 本次攝取

source: 正在保存…
en: Saving…
zh_hant: 正在儲存…

source: 当前份量无法可靠换算，请选择可用单位和数量。
en: This portion can’t be calculated reliably. Choose an available unit and quantity.
zh_hant: 目前份量無法可靠換算，請選擇可用的單位與數量。

source: 扫描营养表
en: Scan Nutrition Label
zh_hant: 掃描營養標示

source: 让营养表占满画面，保持镜头平行
en: Fill the frame with the label and keep the camera parallel
zh_hant: 讓營養標示充滿畫面，鏡頭保持平行

source: 拍摄包装营养表
en: Photograph Nutrition Label
zh_hant: 拍攝包裝營養標示

source: 拍摄后立即在本机识别文字
en: Text is recognized on this device immediately after capture
zh_hant: 拍攝後立即在本機辨識文字

source: 本机识别，不上传照片
en: Processed on device. Photos aren’t uploaded.
zh_hant: 本機辨識，不上傳照片

source: 识别值必须由你确认后才会按条码保存
en: Recognized values are saved for this barcode only after you confirm them
zh_hant: 辨識數值須由你確認後才會依條碼儲存

source: 包装上的 Nutrition Facts
en: Nutrition Facts on the Package
zh_hant: 包裝上的 Nutrition Facts

source: 正在本机读取营养数字…
en: Reading Nutrition Values On Device…
zh_hant: 正在本機讀取營養數值…

source: 通常只需几秒
en: This usually takes only a few seconds
zh_hant: 通常只需幾秒

source: 拍摄完整营养表
en: Photograph the Full Label
zh_hant: 拍攝完整營養標示

source: 需要重新拍摄
en: Retake Needed
zh_hant: 需要重新拍攝

source: 靠近包装，让标题、每份大小、热量和三大营养素都进入画面。
en: Move closer so the title, serving size, calories, and all three macros are in frame.
zh_hant: 靠近包裝，讓標題、每份大小、熱量和三大營養素都進入畫面。

source: 本机 OCR 已完成
en: On-Device OCR Complete
zh_hant: 本機 OCR 已完成

source: 演示 OCR 已完成
en: Demo OCR Complete
zh_hant: 示範 OCR 已完成

source: 只需核对标橙字段，然后继续选择食用量
en: Check the orange fields, then continue to choose the amount eaten
zh_hant: 只需核對橙色欄位，再繼續選擇食用量

source: 拍照
en: Take Photo

source: 重拍
en: Retake

source: 从相册选择
en: Choose from Photos
zh_hant: 從相簿選擇

source: 商品名称
en: Product Name
zh_hant: 商品名稱

source: 品牌（可不填）
en: Brand (Optional)
zh_hant: 品牌（選填）

source: 条码
en: Barcode
zh_hant: 條碼

source: 使用标签哪一列
en: Which Label Column to Use
zh_hant: 使用標示的哪一欄

source: 这些数值是
en: These Values Are
zh_hant: 這些數值是

source: 每份说明（如 5 块 / 85g）
en: Serving description (e.g. 5 pieces / 85 g)
zh_hant: 每份說明（例如 5 塊 / 85g）

source: 份量换算信息
en: Portion Conversion Details
zh_hant: 份量換算資訊

source: 每份重量
en: Weight per Serving

source: 每份体积
en: Volume per Serving
zh_hant: 每份體積

source: 每份数量
en: Items per Serving
zh_hant: 每份數量

source: 每包份数
en: Servings per Package
zh_hant: 每包份數

source: 营养基准与份量
en: Nutrition Basis & Portion
zh_hant: 營養基準與份量

source: 这里决定之后按克、份、毫升、个或整包换算；程序不会猜缺失数据。
en: This controls later calculations by gram, serving, milliliter, item, or package. Missing data won’t be guessed.
zh_hant: 這裡決定之後依克、份、毫升、個或整包換算；程式不會猜測缺失資料。

source: 其他营养素
en: Other Nutrients
zh_hant: 其他營養素

source: 我已核对标橙字段
en: I checked the orange fields
zh_hant: 我已核對橙色欄位

source: 保存前确认
en: Confirm Before Saving
zh_hant: 儲存前確認

source: 正在保存商品…
en: Saving Product…
zh_hant: 正在儲存商品…

source: 确认并继续记录
en: Confirm & Continue
zh_hant: 確認並繼續記錄

source: 需要核对
en: Needs Review
zh_hant: 需要核對

source: 必填
en: Required

source: 没有读到可用的营养数字，请靠近后重拍。
en: No usable nutrition values were found. Move closer and retake the photo.
zh_hant: 沒有讀到可用的營養數值，請靠近後重拍。

source: 营养基准
en: Nutrition Basis
zh_hant: 營養基準

source: 份量信息
en: Portion Details
zh_hant: 份量資訊

source: 请确认 OCR 结果
en: Confirm the OCR Results
zh_hant: 請確認 OCR 結果

source: 请先核对并确认标橙字段
en: Check and confirm the orange fields first
zh_hant: 請先核對並確認橙色欄位

source: 请填写商品名称
en: Enter a product name
zh_hant: 請填寫商品名稱

source: 请确认热量是大于 0 的数字
en: Confirm that calories are a number greater than 0
zh_hant: 請確認熱量為大於 0 的數字

source: 营养数值只能填写非负数字
en: Nutrient values must be nonnegative numbers
zh_hant: 營養數值只能填寫非負數

source: 包装食品
en: Packaged Food
zh_hant: 包裝食品

source: 每份
en: Per Serving

source: 每 100 克
en: Per 100 g

source: 每 100 毫升
en: Per 100 mL

source: 整包
en: Whole Package

source: 每个
en: Per Item
zh_hant: 每個

source: 星巴克定制核对
en: Starbucks Customization Check
zh_hant: 星巴克客製核對

source: 24 fl oz · 4 份浓缩
en: 24 fl oz · 4 espresso shots
zh_hant: 24 fl oz · 4 份濃縮

source: Starbucks 标准显示
en: Starbucks Standard Listing
zh_hant: Starbucks 標準顯示

source: 咖啡因
en: Caffeine

source: 当前建议记录
en: Recommended Entry
zh_hant: 目前建議記錄

source: 饮品
en: Drink
zh_hant: 飲品

source: 标准热量不会随 App 内自定义实时变化；下面按你最终喝到的配方重新估算。
en: The standard calorie listing doesn’t update with in-app customizations. The estimate below uses the drink you actually ordered.
zh_hant: 標準熱量不會隨 App 內客製內容即時變化；下方會依你最後喝到的配方重新估算。

source: 糖浆
en: Syrup
zh_hant: 糖漿

source: 这里填最终总泵数，不是“额外再加几泵”。
en: Enter the final total pump count, not the number of extra pumps.
zh_hant: 這裡填最終總泵數，不是「額外再加幾泵」。

source: 加料
en: Add-ons

source: 此冷泡沫没有单独公开的官方完整营养值；按 Starbucks 官方相邻蛋白冷泡沫饮品推算。
en: Starbucks doesn’t publish complete nutrition for this cold foam alone, so this estimate uses similar official protein cold-foam drinks.
zh_hant: 此冷泡沫沒有單獨公開的官方完整營養值；依 Starbucks 官方相近蛋白冷泡沫飲品推算。

source: 估算拆分
en: Estimate Breakdown

source: 标准饮品
en: Standard Drink
zh_hant: 標準飲品

source: 糖浆变化
en: Syrup Change
zh_hant: 糖漿變化

source: 蛋白冷泡沫
en: Protein Cold Foam

source: 蛋白冷泡沫（推算）
en: Protein Cold Foam (Estimated)

source: 建议记录
en: Recommended Entry
zh_hant: 建議記錄

source: 蛋白质（估算）
en: Protein (Estimated)
zh_hant: 蛋白質（估算）

source: 碳水（估算）
en: Carbs (Estimated)

source: 脂肪（估算）
en: Fat (Estimated)

source: 营养素
en: Nutrients
zh_hant: 營養素

source: 咖啡因主要由浓缩份数决定；减少糖浆不会降低咖啡因。
en: Caffeine mostly depends on the number of espresso shots. Reducing syrup doesn’t reduce caffeine.
zh_hant: 咖啡因主要由濃縮份數決定；減少糖漿不會降低咖啡因。

source: 记录前确认
en: Confirm Before Logging
zh_hant: 記錄前確認

source: 没有相机权限
en: No Camera Access
zh_hant: 沒有相機權限

source: 当前设备没有可用相机
en: No Camera Available on This Device
zh_hant: 目前裝置沒有可用相機

source: 相机启动失败
en: Couldn’t Start Camera
zh_hant: 相機啟動失敗

source: 拍照失败
en: Couldn’t Take Photo
zh_hant: 拍照失敗

source: 照片读取失败
en: Couldn’t Read Photo
zh_hant: 照片讀取失敗

source: 请在系统设置中允许「减重助手」使用相机。
en: Allow WeightCoach to use the camera in Settings.
zh_hant: 請在系統設定中允許「減重助手」使用相機。

source: 模拟器不提供相机，请在真机拍摄，或改用相册照片。
en: The simulator has no camera. Take a photo on a real device or choose one from Photos.
zh_hant: 模擬器不提供相機，請在實機拍攝，或改用相簿照片。

source: 请保持镜头稳定后重新拍摄。
en: Hold the camera steady and try again.
zh_hant: 請保持鏡頭穩定後重新拍攝。

source: 对准食物，轻点拍摄
en: Point at the food and tap to capture
zh_hant: 對準食物，輕點拍攝

source: 拍摄食物照片
en: Take Food Photo
zh_hant: 拍攝食物照片

source: 拍摄后立即开始识别，不再显示确认页面
en: Recognition starts immediately after capture without another confirmation screen
zh_hant: 拍攝後立即開始辨識，不再顯示確認頁面

source: 正在打开相机…
en: Opening Camera…
zh_hant: 正在開啟相機…

source: 退出拍照
en: Exit Camera

source: 关闭闪光灯
en: Turn Flash Off
zh_hant: 關閉閃光燈

source: 打开闪光灯
en: Turn Flash On
zh_hant: 開啟閃光燈

source: 当前相机没有闪光灯
en: This camera has no flash
zh_hant: 目前相機沒有閃光燈

source: 正在拍摄…
en: Capturing…
zh_hant: 正在拍攝…

source: 相机不可用
en: Camera Unavailable
zh_hant: 相機無法使用

source: 打开系统设置
en: Open Settings
zh_hant: 開啟系統設定

source: 相机输入或照片输出不可用，请重新打开拍照页。
en: Camera input or photo output is unavailable. Reopen the camera screen.
zh_hant: 相機輸入或照片輸出無法使用，請重新開啟拍照頁面。

source: 身体成分与校准
en: Body Composition & Calibration
zh_hant: 身體組成與校準

source: Apple 健康 → 本地记录 → 校准体脂
en: Apple Health → Local Entries → Calibrated Body Fat
zh_hant: Apple 健康 → 本機記錄 → 校準體脂

source: 只有前两者都没有有效体脂时，才使用校准体脂计算 BMR。历史 DEXA 和其他肌肉口径都不会进入预算计算。
en: Calibrated body fat is used for BMR only when neither of the first two sources has valid data. Historical DEXA and other muscle measures never affect the budget.
zh_hant: 只有前兩者都沒有有效體脂時，才使用校準體脂計算 BMR。歷史 DEXA 與其他肌肉口徑都不會進入預算計算。

source: 当前校准兜底
en: Current Calibration Fallback
zh_hant: 目前校準備援

source: 体脂数据优先级
en: Body Fat Data Priority
zh_hant: 體脂資料優先順序

source: 当前校准
en: Current Calibration
zh_hant: 目前校準

source: 不同测量口径
en: Different Measurement Definitions
zh_hant: 不同測量口徑

source: 历史 DEXA
en: Historical DEXA
zh_hant: 歷史 DEXA

source: 日均摄入参考
en: Daily Intake Reference
zh_hant: 日均攝取參考

source: 这是个人参考，不会替代今日预算，也不会改变 TDEE 替代模型、动态缺口或安全下限。
en: This is a personal reference only. It doesn’t replace today’s budget or change the TDEE replacement model, dynamic deficit, or safety floor.
zh_hant: 這是個人參考，不會取代今日預算，也不會改變 TDEE 替代模型、動態缺口或安全下限。

source: 热量参考
en: Calorie Reference
zh_hant: 熱量參考

source: 此项按用户提供信息显示为约值
en: Shown as an approximate value based on information you provided
zh_hant: 此項依使用者提供的資訊顯示為約值

source: 口径说明
en: Definition
zh_hant: 口徑說明

source: 精确值
en: Exact Value
zh_hant: 精確值

source: 范围下限
en: Range Minimum
zh_hant: 範圍下限

source: 范围上限
en: Range Maximum
zh_hant: 範圍上限

source: 数值
en: Values
zh_hant: 數值

source: 只有范围时可将精确值留空；App 不会自动取中点。
en: If you only have a range, leave the exact value blank. The app won’t assume the midpoint.
zh_hant: 只有範圍時可將精確值留白；App 不會自動取中點。

source: 来源
en: Source
zh_hant: 來源

source: 有测量日期
en: Measurement Date Available
zh_hant: 有測量日期

source: 测量日期
en: Measurement Date
zh_hant: 測量日期

source: 日期未提供；打开编辑页不会自动填成今天。
en: No date was provided. Opening this editor won’t set it to today.
zh_hant: 未提供日期；開啟編輯頁不會自動填成今天。

source: 来源与日期
en: Source & Date
zh_hant: 來源與日期

source: 口径、约值或其他说明
en: Definition, approximation, or other notes
zh_hant: 口徑、約值或其他說明

source: 备注
en: Notes
zh_hant: 備註

source: 清空此项
en: Clear This Item
zh_hant: 清除此項

source: 清空后会保持为空，不会在下次启动重新灌入默认值。
en: After clearing, it stays empty and won’t be repopulated on the next launch.
zh_hant: 清空後會保持空白，不會在下次啟動時重新填入預設值。

source: 日均参考
en: Daily Reference
zh_hant: 日均參考

source: 仅用于显示个人参考；不进入 BMR、TDEE、动态缺口或今日预算。
en: Display-only personal reference. It doesn’t affect BMR, TDEE, the dynamic deficit, or today’s budget.
zh_hant: 僅用於顯示個人參考；不會進入 BMR、TDEE、動態缺口或今日預算。

source: 校准体脂率
en: Calibrated Body Fat
zh_hant: 校準體脂率

source: 校准脂肪量
en: Calibrated Fat Mass
zh_hant: 校準脂肪量

source: 完整去脂体重
en: Total Fat-Free Mass
zh_hant: 完整去脂體重

source: DEXA 瘦软组织
en: DEXA Lean Soft Tissue
zh_hant: DEXA 瘦軟組織

source: 四肢瘦体重
en: Appendicular Lean Mass
zh_hant: 四肢瘦體重

source: Fitdays 肌肉量
en: Fitdays Muscle Mass

source: 骨骼肌量
en: Skeletal Muscle Mass

source: 历史体脂率
en: Historical Body Fat
zh_hant: 歷史體脂率

source: 历史脂肪量
en: Historical Fat Mass
zh_hant: 歷史脂肪量

source: 历史瘦软组织
en: Historical Lean Soft Tissue
zh_hant: 歷史瘦軟組織

source: 历史总重
en: Historical Total Mass
zh_hant: 歷史總重

source: 综合校准体脂；仅在健康与本地体脂都缺失时作为 BMR 兜底。
en: Combined calibrated body fat, used for BMR only when Health and local body-fat data are both unavailable.
zh_hant: 綜合校準體脂；僅在健康與本機體脂都缺失時作為 BMR 備援。

source: 身体中脂肪组织的质量。
en: The mass of fat tissue in the body.
zh_hant: 身體中脂肪組織的質量。

source: 全部非脂肪质量，包含骨矿物；不等同于肌肉量。
en: All non-fat mass, including bone mineral; not the same as muscle mass.
zh_hant: 全部非脂肪質量，包含骨礦物；不等同於肌肉量。

source: DEXA lean soft tissue，排除脂肪与骨矿物。
en: DEXA lean soft tissue, excluding fat and bone mineral.
zh_hant: DEXA lean soft tissue，排除脂肪與骨礦物。

source: 四肢 lean mass，是 DEXA 瘦软组织的子集。
en: Appendicular lean mass, a subset of DEXA lean soft tissue.
zh_hant: 四肢 lean mass，是 DEXA 瘦軟組織的子集。

source: Fitdays 设备定义的肌肉量，不能与 DEXA 口径互换。
en: Muscle mass defined by the Fitdays device; not interchangeable with DEXA measures.
zh_hant: Fitdays 裝置定義的肌肉量，不能與 DEXA 口徑互換。

source: 设备估算的骨骼肌量，不等同于完整去脂体重。
en: Device-estimated skeletal muscle mass; not the same as total fat-free mass.
zh_hant: 裝置估算的骨骼肌量，不等同於完整去脂體重。

source: 骨骼肌指数，独立单位为 kg/m²。
en: Skeletal muscle index, measured separately in kg/m².
zh_hant: 骨骼肌指數，獨立單位為 kg/m²。

source: 历史 DEXA 体脂率，只作历史对照。
en: Historical DEXA body-fat percentage, for comparison only.
zh_hant: 歷史 DEXA 體脂率，只作歷史對照。

source: 历史 DEXA 脂肪量。
en: Historical DEXA fat mass.
zh_hant: 歷史 DEXA 脂肪量。

source: 历史 DEXA lean soft tissue，不含骨矿物。
en: Historical DEXA lean soft tissue, excluding bone mineral.
zh_hant: 歷史 DEXA lean soft tissue，不含骨礦物。

source: 历史 DEXA 总重约值；不会由其他字段相加推算。
en: Approximate historical DEXA total mass; never inferred by adding other fields.
zh_hant: 歷史 DEXA 總重約值；不會由其他欄位相加推算。

source: 先建立你的个人资料
en: Set Up Your Profile
zh_hant: 先建立你的個人資料

source: 这些资料只保存在你的设备，用于计算热量和营养目标。Apple 健康中的最新数据仍会优先使用。
en: This information stays on your device and is used to calculate calorie and nutrition goals. The latest data from Apple Health still takes priority.
zh_hant: 這些資料只儲存在你的裝置上，用來計算熱量與營養目標。Apple 健康中的最新資料仍會優先使用。

source: 身体资料
en: Body Details
zh_hant: 身體資料

source: 身高
en: Height

source: 厘米
en: cm
zh_hant: 公分

source: 生理性别
en: Sex
zh_hant: 生理性別

source: 请选择
en: Select
zh_hant: 請選擇

source: 男
en: Male

source: 女
en: Female

source: 出生年份
en: Birth Year

source: 减重目标
en: Weight-Loss Goal
zh_hant: 減重目標

source: 千克
en: kg
zh_hant: 公斤

source: 目标体重
en: Goal Weight
zh_hant: 目標體重

source: 目标日期
en: Goal Date
zh_hant: 目標日期

source: 请完整填写有效资料；目标体重需要低于当前体重。
en: Complete all fields with valid information. Goal weight must be below current weight.
zh_hant: 請完整填寫有效資料；目標體重需低於目前體重。

source: 欢迎使用减重助手
en: Welcome to WeightCoach
zh_hant: 歡迎使用減重助手

source: 开始使用
en: Get Started
zh_hant: 開始使用

source: 咖啡因说明
en: About Caffeine
zh_hant: 咖啡因說明

source: mg · 今日已知
en: mg · known today

source: 仅统计已记录数值；留空不会被误算成 0。
en: Only known values are counted. Blank entries are not treated as zero.
zh_hant: 只統計已記錄數值；留白不會被誤算為 0。

source: 400 mg 是 FDA 对多数健康成人的每日参考上限，不是你的个人目标。
en: 400 mg is the FDA’s daily reference limit for most healthy adults, not your personal goal.
zh_hant: 400 mg 是 FDA 對多數健康成人的每日參考上限，不是你的個人目標。

source: 怎么统计
en: How It’s Counted
zh_hant: 如何統計

source: 只累加每条饮食记录里明确填写或由可靠品牌配方给出的咖啡因。普通照片看不出浓缩份数时，系统会保留为未知。
en: Only caffeine explicitly entered or provided by a reliable branded recipe is added. When a photo can’t reveal the number of espresso shots, caffeine remains unknown.
zh_hant: 只累加每筆飲食記錄中明確填寫或由可靠品牌配方提供的咖啡因。一般照片看不出濃縮份數時，系統會保留為未知。

source: 400 mg 参考
en: 400 mg Reference
zh_hant: 400 mg 參考

source: FDA 表示，对多数健康成人而言，每天 400 mg 通常不会带来负面影响；敏感程度会因人、药物和健康状况而异。
en: The FDA says 400 mg per day is generally not associated with negative effects for most healthy adults. Sensitivity varies by person, medication, and health condition.
zh_hant: FDA 表示，對多數健康成人而言，每天 400 mg 通常不會帶來負面影響；敏感程度會因人、藥物與健康狀況而異。

source: 孕期、哺乳期、心律问题或医生有特别要求时，请遵循专业建议。
en: If you are pregnant, breastfeeding, have a heart-rhythm condition, or received specific medical advice, follow professional guidance.
zh_hant: 孕期、哺乳期、心律問題或醫師有特別要求時，請遵循專業建議。

source: 已超出
en: Over By

source: 还能吃
en: Remaining
zh_hant: 還能吃

source: 营养摄入
en: Nutrition Intake
zh_hant: 營養攝取

source: 营养目标如何计算
en: How Nutrition Goals Are Calculated
zh_hant: 營養目標如何計算

source: 已摄入
en: Consumed
zh_hant: 已攝取
